<?php
    //设置可用内存大小
    ini_set ('memory_limit', '128M');

    //生成六个月前1号的时间戳，生成六个月的数据
    $now = date('Y-m-d H:i:s');
    $nowStamp = strtotime($now);
    $start = date('Y-m', strtotime($now.'-5 month')).'-01';
    $startStamp = strtotime($start);

    $path = "c:\Users\hyj91\desktop\insert3.sql";
    $str = "use dudu;\r\n";

    //生成用户注册数据
    $str1 = "insert into d_user values\r\n";    //乘客注册数据
    $str2 = "insert into d_driver values\r\n";    //司机注册数据

    //生成订单数据
    $str3 = "insert into d_order_list values\r\n";

    while ($startStamp <= $nowStamp) {
        //生成乘客数据
        $num = rand(20, 100);  //每天随机乘客注册人数

        for ($i = 0; $i < $num; $i++) {
            $time = date('Y-m-d H:i:s', $startStamp + rand(0, 86399));   //随机注册时间
            $name = randName();     //随机注册名字
            $idNum = randIdNum();   //随机生成身份证号
            $tel = randTel();       //随机注册电话号码
            $openId = randOpenId(); //随机生成openId

            $one = "(null, '".$time."', 'e10adc3949ba59abbe56e057f20f883e', '".$name."', '".$idNum."', '".$tel."', 10, 10000, '使用', 'user-head.jpg', '仓山区金山大道', 110000, 110100, 110101, '".$openId."'),\r\n";

            $str1 .= $one;
        }

        //生成司机数据
        $num = rand(5, 40);  //每天随机司机注册人数

        for ($i = 0; $i < $num; $i++) {
            $time1 = date('Y-m-d H:i:s', $startStamp + rand(0, 86399));   //随机注册时间
            $time2 = date('Y-m-d H:i:s', $startStamp - rand(94867200, 221356800));   //随机驾照申领时间
            $time3 = date('Y-m-d H:i:s', $startStamp - rand(0, 221356800));   //随机车辆注册时间
            $name1 = randName();     //随机注册名字
            $name2 = randName();    //随机车辆拥有人名字
            $idNum = randIdNum();   //随机生成身份证号
            $tel = randTel();       //随机注册电话号码
            $openId = randOpenId(); //随机生成openId
            $licenseNum = randLicenseNum();     //随机生成车牌号
            $carBrand = randCarBrand();     //随机生成汽车品牌
            $btId = rand(1, 2);
            $bankNum = randBankNum();

            $one = "(null, 'e10adc3949ba59abbe56e057f20f883e', '".$time1."', 110000, 110100, 110101, '台江区万达广场', '".$name1."', '".$idNum."', '".$time2."', '".$licenseNum."', '".$carBrand."', '".$name2."', '".$time3."', 0, '".$tel."', '使用', 10, 'https://wx.qlogo.cn/mmopen/vi_32/Q0j4TwGTfTIIiaaUdsrCxZRbn7jh9xVsE9GwonvWlPGYQlVfk7SATc2NVkjGia178RD3WfGw6ibCAJUCvSWzQ7RvA/0', ".$btId.", '".$bankNum."', '".$openId."'),\r\n";

            $str2 .= $one;
        }

        //随机生成出租车订单
        $num = rand(50, 250);

        for ($i = 0; $i < $num; $i++) {
            $userId = rand(1, 7000);
            $drivId = rand(1, 3000);
            $time1 = date('Y-m-d H:i:s', $startStamp + rand(0, 86399));   //随机开始时间
            $time2 = date('Y-m-d H:i:s', strtotime($time1) + rand(600, 3600));  //随机结束时间
            $mNum = (strtotime($time2) - strtotime($time1)) * 12;
            $arr1 = [0, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9];
            $mPrice = rand(8, 30) + $arr1[array_rand($arr1, 1)];
            $tPrice = rand(2, 10) + $arr1[array_rand($arr1, 1)];
            $arr2 = [3, 5, 5, 5, 5, 5, 5, 5, 5];
            $olsId = $arr2[array_rand($arr2, 1)];
            $btId = 1;

            $one = "(null, '".$userId."', '".$drivId."', '".$time1."' , '".$time2."', 3, '".$olsId."', '".$mNum."' , '".$mPrice."' , '".$tPrice."', 0, 26.07857, 119.30426, 26.08985, 119.28171, '福州协和医院', '福州总医院', '".$btId."'),\r\n";

            $str3 .= $one;
        }

        //随机生成快车订单
        $num = rand(50, 250);

        for ($i = 0; $i < $num; $i++) {
            $userId = rand(1, 7000);
            $drivId = rand(1, 3000);
            $time1 = date('Y-m-d H:i:s', $startStamp + rand(0, 86399));   //随机开始时间
            $time2 = date('Y-m-d H:i:s', strtotime($time1) + rand(600, 3600));  //随机结束时间
            $mNum = (strtotime($time2) - strtotime($time1)) * 12;
            $arr1 = [0, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9];
            $mPrice = rand(8, 30) + $arr1[array_rand($arr1, 1)];
            $tPrice = rand(2, 10) + $arr1[array_rand($arr1, 1)];
            $arr2 = [3, 5, 5, 5, 5, 5, 5, 5, 5];
            $olsId = $arr2[array_rand($arr2, 1)];
            $btId = 2;

            $one = "(null, '".$userId."', '".$drivId."', '".$time1."' , '".$time2."', 3, '".$olsId."', '".$mNum."' , '".$mPrice."' , '".$tPrice."', 0, 26.07857, 119.30426, 26.08985, 119.28171, '福州协和医院', '福州总医院', '".$btId."'),\r\n";

            $str3 .= $one;
        }

        $startStamp += 86400;
    }

    //给最后加上分号
    $str1 = substr($str1,0,strlen($str1) - 3);
    $str1 .= ";\r\n";

    $str2 = substr($str2,0,strlen($str2) - 3);
    $str2 .= ";\r\n";

    $str3 = substr($str3,0,strlen($str3) - 3);
    $str3 .= ";\r\n";

    $str .= $str1.$str2.$str3;

    file_put_contents($path, $str);

    //随机生成姓名
    function randName() {
        $xing = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许', '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章', '云', '苏', '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳', '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常', '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹', '姚', '邵', '湛', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞', '熊', '纪', '舒', '屈', '项', '祝', '董', '梁', '杜', '阮', '蓝', '闵', '席', '季', '麻', '强', '贾', '路', '娄', '危', '江', '童', '颜', '郭', '梅', '盛', '林', '刁', '钟', '徐', '邱', '骆', '高', '夏', '蔡', '田', '樊', '胡', '凌', '霍', '虞', '万', '支', '柯', '昝', '管', '卢', '莫', '经', '房', '裘', '缪', '干', '解', '应', '宗', '丁', '宣', '贲', '邓', '郁', '单', '杭', '洪', '包', '诸', '左', '石', '崔', '吉', '钮', '龚', '程', '嵇', '邢', '滑', '裴', '陆', '荣', '翁', '荀', '羊', '於', '惠', '甄', '麴', '家', '封', '芮', '羿', '储', '靳', '汲', '邴', '糜', '松', '井', '段', '富', '巫', '乌', '焦', '巴', '弓', '牧', '隗', '山', '谷', '车', '侯', '宓', '蓬', '全', '郗', '班', '仰', '秋', '仲', '伊', '宫', '宁', '仇', '栾', '暴', '甘', '钭', '厉', '戎', '祖', '武', '符', '刘', '景', '詹', '束', '龙', '叶', '幸', '司', '韶', '郜', '黎', '蓟', '薄', '印', '宿', '白', '怀', '蒲', '邰', '从', '鄂', '索', '咸', '籍', '赖', '卓', '蔺', '屠', '蒙', '池', '乔', '阴', '郁', '胥', '能', '苍', '双', '闻', '莘', '党', '翟', '谭', '贡', '劳', '逄', '姬', '申', '扶', '堵', '冉', '宰', '郦', '雍', '舄', '璩', '桑', '桂', '濮', '牛', '寿', '通', '边', '扈', '燕', '冀', '郏', '浦', '尚', '农', '温', '别', '庄', '晏', '柴', '瞿', '阎', '充', '慕', '连', '茹', '习', '宦', '艾', '鱼', '容', '向', '古', '易', '慎', '戈', '廖', '庾', '终', '暨', '居', '衡', '步', '都', '耿', '满', '弘', '匡', '国', '文', '寇', '广', '禄', '阙', '东', '殴', '殳', '沃', '利', '蔚', '越', '夔', '隆', '师', '巩', '厍', '聂', '晁', '勾', '敖', '融', '冷', '訾', '辛', '阚', '那', '简', '饶', '空', '曾', '毋', '沙', '乜', '养', '鞠', '须', '丰', '巢', '关', '蒯', '相', '查', '後', '荆', '红'];

        $ming = ['修', '思', '鹤', '弘', '至', '周', '霖','志', '晓', '晋', '哲', '恭', '长', '华','峻', '天', '君', '楷', '善', '邦', '祺','嘉', '浩', '明', '建', '振', '维', '宸','煜', '文', '鹏', '绍', '乐', '其', '豪','懿', '鹭', '炎', '泽', '立', '闻', '然','烨', '瑞', '俊', '鑫', '金', '展', '源','苑', '致', '雨', '德', '锦', '炫', '渊','伟', '健', '晟', '松', '语', '杰', '淼','熠', '耀', '远', '光', '蓝', '熙', '啸','鸿', '潇', '旭', '祥', '翰', '城', '洋','博', '子', '荣', '忆', '江', '轩', '雄','智', '宇', '越', '和', '弈', '彤', '磊','正', '胤', '皓', '连', '羽', '煊', '涵','昊', '国', '睿', '温', '朝', '涛', '彬','姿', '梨', '秋', '蕾', '瑾', '羽', '菡','莺', '卿', '柳', '曼', '惠', '灵', '萍','思', '婉', '盼', '艺', '雯', '冰', '菲','雪', '旋', '玥', '蓝', '晓', '如', '燕','紫', '甜', '春', '海', '静', '绮', '曦','悦', '梅', '柔', '迎', '蓉', '瑜', '素','彩', '娅', '盈', '婷', '璇', '瑛', '芳','虹', '英', '怡', '涵', '霎', '舞', '欢','薇', '珠', '丽', '雅', '洁', '嫣', '南','若', '佳', '韵', '茹', '倩', '竹', '纹','敏', '惜', '婕', '凝', '萱', '嘉', '娜','琼', '诗', '婧', '颖', '茵', '菊', '青','枝', '幽', '宛', '姗', '妮', '沛', '桐','昕', '映', '念', '沐', '蕊', '馨', '芬','佩', '欣', '玫', '音', '柏', '夏', '香', '泽', '瑾', '暖', '轩', '扬', '影', '莹', '良', '玉', '谦', '朗', '然', '瑶', '遥', '韶', '颦', '敏', '航', '宇', '凌', '修', '远', '沐', '城', '皓', '澜', '清', '如', '景'];

        $xingLen = count($xing);
        $mingLen = count($ming);

        $mingTypeLen = rand(1, 2);

        $name = $xing[rand(0, $xingLen - 1)];

        for ($i = 0; $i < $mingTypeLen; $i++) {
            $name .= $ming[rand(0, $mingLen - 1)];
        }

        return $name;
    }

    //随机生成电话号码
    function randTel() {
        $arr = array(130,131,132,133,134,135,136,137,138,139,144,147,150,151,152,153,155,156,157,158,159,176,177,178,180,181,182,183,184,185,186,187,188,189);

        return $arr[rand(0, count($arr) - 1)].rand(10000000, 99999999);
    }

    //随机生成openid
    function randOpenId() {
        $str = '0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ-';
        $len = strlen($str);

        $id = '';

        for ($i = 0; $i < 28; $i++) {
            $id .= $str[rand(0, $len - 1)];
        }

        return $id;
    }

    //随机生成身份证号
    function randIdNum() {
        $str = '0123456789';
        $len = strlen($str);

        $id = '';

        for ($i = 0; $i < 18; $i++) {
            $id .= $str[rand(0, $len - 1)];
        }

        return $id;
    }

    //生成随机车牌号
    function randLicenseNum() {
        $head = ['京', '津', '沪', '渝', '蒙', '新', '藏', '宁', '桂', '港', '澳', '黑', '吉', '辽', '晋', '冀', '青', '鲁', '豫', '苏', '皖', '浙', '闽', '赣', '湘', '鄂', '粤', '琼', '甘', '陕', '黔', '滇', '川'];

        $body = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ';

        $str = '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ';

        $num = $head[rand(0, count($head) - 1)].$body[rand(0, strlen($body) - 1)];

        for ($i = 0; $i < 5; $i++) {
            $num .= $str[rand(0, strlen($str) - 1)];
        }

        return $num;
    }

    //生成随机汽车品牌
    function randCarBrand() {
        $arr = ['宝马', '奔驰', '法拉利', '玛莎拉蒂', '福特', '兰博基尼', '大众', '本田', '丰田', '讴歌', '雪佛兰', '雪铁龙', '雷克萨斯', '铃木', '马自达', '日产', '别克', '道奇', '吉普', '凯迪拉克', '林肯', '特斯拉', '奥迪', '保时捷', '宝沃', '斯玛特', '三菱', '英菲尼迪', '标致', '雷诺', '宾利', '捷豹', '路虎', '劳斯莱斯', '迈凯伦', '布加迪', '菲亚特', '帕加尼', '柯尼塞格', '沃尔沃', '斯柯达', '比亚迪', '长城', '东风', '传祺'];

        return $arr[rand(0, count($arr) - 1)];
    }

    //生成随机银行卡
    function randBankNum() {
        $str = '0123456789';

        $num = '';

        for ($i = 0; $i < 19; $i++) {
            $num .= $str[rand(0, strlen($str) - 1)];
        }

        return $num;
    }
 ?>
